j = int(input('Сколько чисел нужно поместить в список(Введите число )'))
y = 1
x = []
while y <= j:
    n = int(input())
    x.append(n)
    y += 1
def to_list(*nums):
    return sorted(x)
print(to_list(n))        
             